# Download Data

In [2]:
import os

# Set your target directory
target_dir = "../data/tnbc/"

# Create directory if it doesn't exist
os.makedirs(target_dir, exist_ok=True)

# Download TN1 to TN8 into the target directory
for i in range(1, 9):
    filename = f"TN{i}.tar.gz"
    url = f"https://zenodo.org/records/7225578/files/{filename}?download=1"
    output_path = os.path.join(target_dir, filename)
    print(f"Downloading {filename} to {output_path}...")
    !curl -L -o "{output_path}" "{url}"

Downloading TN1.tar.gz to ../data/tnbc/TN1.tar.gz...
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100 63.1M  100 63.1M    0     0  8666k      0  0:00:07  0:00:07 --:--:-- 8918k 0  0:00:07  0:00:05  0:00:02 9621k
Downloading TN2.tar.gz to ../data/tnbc/TN2.tar.gz...
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100 58.3M  100 58.3M    0     0  4475k      0  0:00:13  0:00:13 --:--:-- 11.2Mk      0  0:00:17  0:00:12  0:00:05 8031k
Downloading TN3.tar.gz to ../data/tnbc/TN3.tar.gz...
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100 51.3M  100 51.3M    0     0  7657k      0  0:00:06  0:00:06 --:--:-- 8323k
Downloading TN4.tar.gz to ../data/tnbc/TN4.tar.gz...
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100 65.0M  100 65.0M    0     0  5030k      0  0:00:13  0:00:13 --:--:-- 6730k0:05:15 --:--:--  0:05:15  211k5  0:00:02  0:00:23 2624k
Downloading TN5.tar.gz to ../data/tnbc/TN5.tar.gz...
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100 56.2M  100 56.2M    0     0  11.8M      0  0:00:04  0:00:04 --:--:-- 11.8M
Downloading TN6.tar.gz to ../data/tnbc/TN6.tar.gz...
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100 55.9M  100 55.9M    0     0  12.3M      0  0:00:04  0:00:04 --:--:-- 12.3M0  6523k      0  0:00:08  0:00:01  0:00:07 6521k
Downloading TN7.tar.gz to ../data/tnbc/TN7.tar.gz...
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100 41.3M  100 41.3M    0     0  5559k      0  0:00:07  0:00:07 --:--:-- 3476k
Downloading TN8.tar.gz to ../data/tnbc/TN8.tar.gz...
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100 87.9M  100 87.9M    0     0   9.8M      0  0:00:08  0:00:08 --:--:-- 10.4M

In [3]:
import glob
import os

data_dir = "../data/tnbc"

for tar_path in glob.glob(os.path.join(data_dir, "*.tar.gz")):
    print(f"Extracting {tar_path}...")
    !tar -xvf "{tar_path}" -C "{data_dir}"

Extracting ../data/tnbc/TN7.tar.gz...
tar: Failed to set default locale
x TN7/
x TN7/cellclust_gt.csv
x TN7/reads_per_bin.csv
x TN7/dataframe.tsv
x TN7/binned_read_count_embedding.csv
x TN7/mut_map.csv
x TN7/cell_map.csv
Extracting ../data/tnbc/TN5.tar.gz...
tar: Failed to set default locale
x TN5/
x TN5/cellclust_gt.csv
x TN5/reads_per_bin.csv
x TN5/dataframe.tsv
x TN5/binned_read_count_embedding.csv
x TN5/mut_map.csv
x TN5/cell_map.csv
Extracting ../data/tnbc/TN1.tar.gz...
tar: Failed to set default locale
x TN1/
x TN1/cellclust_gt.csv
x TN1/reads_per_bin.csv
x TN1/dataframe.tsv
x TN1/binned_read_count_embedding.csv
x TN1/mut_map.csv
x TN1/cell_map.csv
Extracting ../data/tnbc/TN3.tar.gz...
tar: Failed to set default locale
x TN3/
x TN3/cellclust_gt.csv
x TN3/reads_per_bin.csv
x TN3/dataframe.tsv
x TN3/binned_read_count_embedding.csv
x TN3/mut_map.csv
x TN3/cell_map.csv
Extracting ../data/tnbc/TN6.tar.gz...
tar: Failed to set default locale
x TN6/
x TN6/cellclust_gt.csv
x TN6/reads_per_bin.csv
x TN6/dataframe.tsv
x TN6/binned_read_count_embedding.csv
x TN6/mut_map.csv
x TN6/cell_map.csv
Extracting ../data/tnbc/TN8.tar.gz...
tar: Failed to set default locale
x TN8/
x TN8/cellclust_gt.csv
x TN8/reads_per_bin.csv
x TN8/dataframe.tsv
x TN8/binned_read_count_embedding.csv
x TN8/mut_map.csv
x TN8/cell_map.csv
Extracting ../data/tnbc/TN4.tar.gz...
tar: Failed to set default locale
x TN4/
x TN4/cellclust_gt.csv
x TN4/reads_per_bin.csv
x TN4/dataframe.tsv
x TN4/binned_read_count_embedding.csv
x TN4/mut_map.csv
x TN4/cell_map.csv
Extracting ../data/tnbc/TN2.tar.gz...
tar: Failed to set default locale
x TN2/
x TN2/cellclust_gt.csv
x TN2/reads_per_bin.csv
x TN2/dataframe.tsv
x TN2/binned_read_count_embedding.csv
x TN2/mut_map.csv
x TN2/cell_map.csv

# View Data

In [1]:
ROOT_DIR = "../data/tnbc/TN3"

In [5]:
import pandas as pd
import numpy as np
import os

In [6]:
df_cell_map = pd.read_csv(os.path.join(ROOT_DIR, "cell_map.csv"))
df_cell_map

      cell_id             cell
0           0  TAACTTAGCTGGTTT
1           1  CCACTTCCAGTAGAA
2           2  ATATTATTTGCGTTT
3           3  CACTACCACGATACG
4           4  CAGATGGCTCCGTTC
...       ...              ...
1096     1096  AATCAAGCAATGGAC
1097     1097  AGCCGGTCTAGCAGC
1098     1098  TATCTATTTGCGATC
1099     1099  TTGTTCACTCCTACC
1100     1100  CCCAATATCGTGAGG

[1101 rows x 2 columns]

In [7]:
df_cellclust = pd.read_csv(os.path.join(ROOT_DIR, "cellclust_gt.csv"))
df_cellclust

      cell  cluster
0      784        1
1      946        1
2      410        1
3      674        1
4      553        1
...    ...      ...
1096   408        9
1097   795        9
1098   530        9
1099   769        9
1100   705        9

[1101 rows x 2 columns]

In [8]:
dataframe = pd.read_csv(os.path.join(ROOT_DIR, "dataframe.tsv"), header=None, names=['chrom', 'snv_pos', 'cell_id', 'alt_base', 'alt', 'total'], sep='\t', index_col=False)
dataframe

       chrom  snv_pos  cell_id alt_base  alt  total
0       chr1    10203      427        T    0      1
1       chr1    10203      781        T    0      2
2       chr1    10203      153        T    1      1
3       chr1    10203       29        T    0      2
4       chr1    10203      446        T    1      1
...      ...      ...      ...      ...  ...    ...
280758  chrY     8933      932        A    1      1
280759  chrY     8933      440        A    1      1
280760  chrY     8933      767        A    0      1
280761  chrY     8933      587        A    0      1
280762  chrY     8933      370        A    0      1

[280763 rows x 6 columns]